[
    {
        "name": "Emma R.",
        "rating": "🧀🧀🧀🧀🧀",
        "review": "Adopting my first mouse was such a wonderful experience! The staff helped me pick the perfect match for my lifestyle, and they answered all my questions with patience and care. My little guy, Peanut, has brought so much joy to my life. Highly recommend this service!"
    },
    {
        "name": "Jake T.",
        "rating": "🧀🧀🧀🧀",
        "review": "I never thought a pet mouse could be so friendly and low-maintenance! The adoption process was smooth and simple. The guides they provided really helped me get set up. Only wish they had a few more breed options, but overall, a fantastic experience!"
    },
    {
        "name": "Sarah L.",
        "rating": "🧀🧀🧀🧀🧀",
        "review": "I was a bit hesitant at first, but I’m so glad I went through with it! They matched me with the perfect little mouse, and it’s been such a joy having him around. I really appreciated the support from the community forum too, as it made me feel more confident as a new pet owner."
    },
    {
        "name": "Mike P.",
        "rating": "🧀🧀🧀🧀🧀",
        "review": "Amazing service! The adoption process was quick, easy, and transparent. They really care about their animals and made sure my new mouse, Biscuit, was healthy and well-adjusted. The vet check-up before adoption was a big plus!"
    },
    {
        "name": "Linda K.",
        "rating": "🧀🧀🧀🧀",
        "review": "The website is so user-friendly, and the team is very responsive. I had a ton of questions, and they were all answered in detail. My new mouse, Sprinkles, is settling in nicely! My only suggestion would be to add more videos on mouse care."
    },
    {
        "name": "Tom A.",
        "rating": "🧀🧀🧀🧀🧀",
        "review": "From start to finish, this was an amazing experience. I was matched with a mouse that has the sweetest personality, and the whole process was smooth. The care guide was super helpful, especially for a first-time owner like me. I’m already considering adopting another one!"
    }
]
